Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS.OuterFillet
Outer Fillet - Corner fillet outer radius.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS.InnerFillet
Inner Fillet - Corner fillet inner radius.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS.WallDesignThickness
Represents wall design thickness of rectangle.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS.WallNominalThickness
Represents wall nominal thickness of rectangle.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
Since:
2015